tutorials/heatTransfer/buoyantSimpleFoam/roomWithThickCeiling/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    boundary
    {
        ceiling
        {
            type            mappedWall;
            sampleMode      nearestPatchFace;
            samplePatch     bottom;
            sampleRegion    baffle3DRegion;
            coupleGroup     ceiling_baffle;

            offsetMode      uniform;
            offset          (0 0 0);
        }
    }


// ************************************************************************* //
